app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users".lastname ASC LIMIT 10 OFFSET 0
---
  def index
    @users = User.order(:lastname).page params[:page]

INSERT INTO "users" ("created_at", "email", "firstname", "lastname", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:admin]
      @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
        @user = User.find(params[:id])
        UserMailer.welcome_email(@user).deliver
        @user.destroy