app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (title LIKE '%%') AND (director LIKE '%%') AND (runtime_in_minutes > 90 AND runtime_in_minutes < 120)

   def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)