app/controllers/reviews_controller.rb

      def create
        @review = @movie.reviews.build(review_params)
        @review.user_id = current_user.id

        if @review.save
---
INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 01 Feb 2016 23:52:08 UTC +00:00], ["movie_id", 1], ["rating_out_of_ten", 7], ["text", "xD!!!!!!!"], ["updated_at", Mon, 01 Feb 2016 23:52:08 UTC +00:00], ["user_id", 1]]

      def load_movie
        @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]